   - [#   1] COI Services.main: 
--------------------------------------------------------------------------------
  38: @app.get('/appointments/{id}')
  39: def get_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(
  40:         Models.appointments_models.Appointment.id == id).first()
  41:     
- 42:     if id > 6:
+ 42:     if not (id > 6):
  43:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  44:     
  45:     if appointment is None:
  46:         raise HTTPException(status_code=404, detail='Appointment not found')
--------------------------------------------------------------------------------
[0.28482 s] survived

   - [#   2] COI Services.main: 
--------------------------------------------------------------------------------
  41:     
  42:     if id > 6:
  43:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  44:     
- 45:     if appointment is None:
+ 45:     if not (appointment is None):
  46:         raise HTTPException(status_code=404, detail='Appointment not found')
  47:     
  48:     return appointment
  49: 
--------------------------------------------------------------------------------
[0.27352 s] survived

   - [#   3] COI Services.main: 
--------------------------------------------------------------------------------
  51: 
  52: 
  53: @app.delete('/appointments/{id}')
  54: def delete_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(Models.appointments_models.Appointment.id == id).first()
- 55:     if id > 6:
+ 55:     if not (id > 6):
  56:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  57:     
  58:     if appointment is None:
  59:         raise HTTPException(status_code=404, detail='Appointment not found')
--------------------------------------------------------------------------------
[0.25634 s] survived

   - [#   5] DDL Services.main: 
--------------------------------------------------------------------------------
  25:         db.close()
  26: 
  27: 
  28: 
- 29: @app.post('/appointments')
- 30: def create_appointment(appointment: AppointmentCreate, db: Session = Depends(get_db)):db_appointment = Appointment(name=appointment.name, time=appointment.time)
+ 29: def create_appointment(appointment: AppointmentCreate, db: Session = Depends(get_db)):
+ 30:     db_appointment = Appointment(name=appointment.name, time=appointment.time)
  31:     db.add(db_appointment)
  32:     db.commit()
  33:     db.refresh(db_appointment)
  34:     return db_appointment
--------------------------------------------------------------------------------
[0.27357 s] survived

   - [#   6] DDL Services.main: 
--------------------------------------------------------------------------------
  34:     return db_appointment
  35: 
  36: 
  37: 
- 38: @app.get('/appointments/{id}')
- 39: def get_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(
+ 38: def get_appointment(id: int, db: Session = Depends(get_db)):
+ 39:     appointment = db.query(Models.appointments_models.Appointment).filter(
  40:         Models.appointments_models.Appointment.id == id).first()
  41:     
  42:     if id > 6:
  43:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
--------------------------------------------------------------------------------
[0.30019 s] survived

   - [#   7] DDL Services.main: 
--------------------------------------------------------------------------------
  49: 
  50: 
  51: 
  52: 
- 53: @app.delete('/appointments/{id}')
- 54: def delete_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(Models.appointments_models.Appointment.id == id).first()
+ 53: def delete_appointment(id: int, db: Session = Depends(get_db)):
+ 54:     appointment = db.query(Models.appointments_models.Appointment).filter(Models.appointments_models.Appointment.id == id).first()
  55:     if id > 6:
  56:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  57:     
  58:     if appointment is None:
--------------------------------------------------------------------------------
[0.27521 s] survived

   - [#   8] ROR Services.main: 
--------------------------------------------------------------------------------
  36: 
  37: 
  38: @app.get('/appointments/{id}')
  39: def get_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(
- 40:         Models.appointments_models.Appointment.id == id).first()
+ 40:         Models.appointments_models.Appointment.id != id).first()
  41:     
  42:     if id > 6:
  43:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  44:     
--------------------------------------------------------------------------------
[0.26540 s] survived

   - [#   9] ROR Services.main: 
--------------------------------------------------------------------------------
  38: @app.get('/appointments/{id}')
  39: def get_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(
  40:         Models.appointments_models.Appointment.id == id).first()
  41:     
- 42:     if id > 6:
+ 42:     if id < 6:
  43:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  44:     
  45:     if appointment is None:
  46:         raise HTTPException(status_code=404, detail='Appointment not found')
--------------------------------------------------------------------------------
[0.27800 s] survived

   - [#  10] ROR Services.main: 
--------------------------------------------------------------------------------
  38: @app.get('/appointments/{id}')
  39: def get_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(
  40:         Models.appointments_models.Appointment.id == id).first()
  41:     
- 42:     if id > 6:
+ 42:     if id >= 6:
  43:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  44:     
  45:     if appointment is None:
  46:         raise HTTPException(status_code=404, detail='Appointment not found')
--------------------------------------------------------------------------------
[0.28576 s] survived

   - [#  11] ROR Services.main: 
--------------------------------------------------------------------------------
  50: 
  51: 
  52: 
  53: @app.delete('/appointments/{id}')
- 54: def delete_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(Models.appointments_models.Appointment.id == id).first()
+ 54: def delete_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(Models.appointments_models.Appointment.id != id).first()
  55:     if id > 6:
  56:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  57:     
  58:     if appointment is None:
--------------------------------------------------------------------------------
[0.28303 s] survived

   - [#  12] ROR Services.main: 
--------------------------------------------------------------------------------
  51: 
  52: 
  53: @app.delete('/appointments/{id}')
  54: def delete_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(Models.appointments_models.Appointment.id == id).first()
- 55:     if id > 6:
+ 55:     if id < 6:
  56:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  57:     
  58:     if appointment is None:
  59:         raise HTTPException(status_code=404, detail='Appointment not found')
--------------------------------------------------------------------------------
[0.26228 s] survived

   - [#  13] ROR Services.main: 
--------------------------------------------------------------------------------
  51: 
  52: 
  53: @app.delete('/appointments/{id}')
  54: def delete_appointment(id: int, db: Session = Depends(get_db)):appointment = db.query(Models.appointments_models.Appointment).filter(Models.appointments_models.Appointment.id == id).first()
- 55:     if id > 6:
+ 55:     if id >= 6:
  56:         raise HTTPException(status_code=400, detail='Appointment ID must be less than or equal to 6')
  57:     
  58:     if appointment is None:
  59:         raise HTTPException(status_code=404, detail='Appointment not found')
--------------------------------------------------------------------------------
[0.24151 s] survived
